zhiqiu-001/tianshu/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/v1/4m.csv"

CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BLE_MESH_ENABLED=y
CONFIG_BLE_MESH_PROVISIONER=y
CONFIG_BLE_MESH_GATT_PROXY=y
CONFIG_BLE_MESH_RELAY=y
CONFIG_BLE_MESH_FRIEND=y

CONFIG_ESP_TASK_WDT_TIMEOUT_S=20

CONFIG_LWIP_SO_RCVBUF=65536
CONFIG_LWIP_SO_SNDBUF=65536
